Repository: shivamkalra123/e-commerce1
Catalog: frontend/src/locales/*/messages.po
Languages: de, fr, nl, zu

source: Warranty card
de: Garantiekarte
fr: Carte de garantie
nl: Garantiekaart
zu: Ikhadi lewaranti

source: We prioritize durability and timeless style over fast trends.
de: Wir setzen auf Langlebigkeit und zeitlosen Stil statt kurzlebiger Trends.
fr: Nous privilégions la durabilité et un style intemporel plutôt que les tendances éphémères.
nl: Wij geven prioriteit aan duurzaamheid en tijdloze stijl boven snelle trends.
zu: Sigxila ekuqineni nasezitayeleni ezingaphelelwa yisikhathi kunokulandela amathrendi asheshayo.

source: Where we’re from
de: Unsere Herkunft
fr: D’où nous venons
nl: Waar we vandaan komen
zu: Sivela kuphi

source: Write a review
de: Bewertung schreiben
fr: Écrire un avis
nl: Schrijf een beoordeling
zu: Bhala ukubuyekeza

source: Loading...
fr: Chargement...
nl: Laden...

source: Email: support@brandedparcels.com
zu: I-imeyili: support@brandedparcels.com

source: INFO
zu: ULWAZI
