Repository: shivamkalra123/e-commerce1
Catalog: frontend/src/locales/*/messages.po
Languages: de, fr, nl, zu

source: {r} Stars
de: {r} Sterne
fr: {r} étoiles
nl: {r} sterren
zu: {r} Izinkanyezi

source: & EXCHANGES
de: & UMTAUSCH
fr: & ÉCHANGES
nl: & RUILEN
zu: & UKUSHINTSHANA

source: 100% Original product
de: 100 % Originalprodukt
fr: Produit 100 % original
nl: 100% origineel product
zu: Umkhiqizo wokuqala ngo-100%

source: 7 days easy return
de: 7 Tage einfache Rückgabe
fr: Retour facile sous 7 jours
nl: 7 dagen eenvoudig retourneren
zu: Ukubuyiselwa okulula kwezinsuku eziyi-7

source: ABOUT
de: ÜBER UNS
fr: À PROPOS
nl: OVER ONS
zu: MAYELANA NATHI

source: About Branded Parcels
de: Über Branded Parcels
fr: À propos de Branded Parcels
nl: Over Branded Parcels
zu: Mayelana ne-Branded Parcels

source: About us
de: Über uns
fr: À propos de nous
nl: Over ons
zu: Mayelana nathi

source: ADD TO CART
de: IN DEN WARENKORB
fr: AJOUTER AU PANIER
nl: IN WINKELWAGEN
zu: ENGEZA ENQOLENI

source: ALL
de: ALLE
fr: TOUT
nl: ALLE

source: All-day delivery (7am–8pm), 2 working days. From $20.
de: Ganztägige Lieferung (7–20 Uhr), 2 Werktage. Ab 20 $.
fr: Livraison toute la journée (7h–20h), 2 jours ouvrés. À partir de 20 $.
nl: Levering de hele dag (7–20 uur), 2 werkdagen. Vanaf $20.
zu: Ukulethwa usuku lonke (7 ekuseni–8 kusihlwa), izinsuku zokusebenza ezi-2. Kusukela ku-$20.

source: ASKED QUESTIONS
de: GESTELLTE FRAGEN
fr: QUESTIONS POSÉES
nl: GESTELDE VRAGEN
zu: IMIBUZO EBUZWE

source: BEST
de: BESTE
fr: MEILLEURS
nl: BESTE
zu: EZINGCONO

source: Built to last
de: Für Langlebigkeit gemacht
fr: Conçu pour durer
nl: Gemaakt om lang mee te gaan
zu: Yakhelwe ukuhlala isikhathi eside

source: Cash on delivery available
de: Nachnahme verfügbar
fr: Paiement à la livraison disponible
nl: Betalen bij levering beschikbaar
zu: Ukukhokha uma ulethwa kuyatholakala

source: CATEGORIES
de: KATEGORIEN
fr: CATÉGORIES
nl: CATEGORIEËN

source: COLLECTION
de: KOLLEKTION
nl: COLLECTIE
zu: IQOQO

source: COLLECTIONS
de: KOLLEKTIONEN
nl: COLLECTIES

source: COMPANY
de: UNTERNEHMEN
fr: ENTREPRISE
nl: BEDRIJF
zu: INKAMPANI

source: CONTACT
de: KONTAKT
zu: XHUMANA

source: Contact Branded Parcels
de: Kontakt Branded Parcels
fr: Contacter Branded Parcels
zu: Xhumana ne-Branded Parcels

source: Copyright 2025 brandedparcels.com - All Right Reserved.
de: Copyright 2025 brandedparcels.com – Alle Rechte vorbehalten.
fr: Copyright 2025 brandedparcels.com – Tous droits réservés.
nl: Copyright 2025 brandedparcels.com – Alle rechten voorbehouden.
zu: Ilungelo lobunikazi 2025 brandedparcels.com – Wonke amalungelo agodliwe.

source: Could not load categories
de: Kategorien konnten nicht geladen werden
fr: Impossible de charger les catégories
nl: Kan categorieën niet laden

source: Customer-first approach
de: Kundenorientierter Ansatz
fr: Approche centrée sur le client
nl: Klantgerichte aanpak
zu: Indlela egxile kumakhasimende

source: Customers may return goods within 14 days of delivery if purchased remotely. Items must be preserved in original condition.
de: Kunden können Waren innerhalb von 14 Tagen nach Lieferung zurückgeben, wenn sie online gekauft wurden. Die Artikel müssen im Originalzustand sein.
fr: Les clients peuvent retourner les articles dans un délai de 14 jours après la livraison s’ils ont été achetés à distance. Les articles doivent être conservés dans leur état d’origine.
nl: Klanten kunnen goederen binnen 14 dagen na levering retourneren indien deze online zijn gekocht. Artikelen moeten in originele staat verkeren.
zu: Amakhasimende angabuyisa izimpahla zingakapheli izinsuku eziyi-14 ngemuva kokulethwa uma zithengwe ku-inthanethi. Izinto kufanele zigcinwe zisesezimeni zazo zokuqala.

source: Defect report (if applicable)
de: Mängelbericht (falls zutreffend)
fr: Rapport de défaut (le cas échéant)
nl: Defectrapport (indien van toepassing)
zu: Umbiko wesiphazamiso (uma usebenza)

source: Delays can occur due to logistics or peak demand. Our support team will assist with tracking and updates.
de: Verzögerungen können aufgrund von Logistik oder hoher Nachfrage auftreten. Unser Support-Team hilft Ihnen bei der Sendungsverfolgung.
fr: Des retards peuvent survenir en raison de la logistique ou de fortes demandes. Notre équipe d’assistance vous aidera avec le suivi et les mises à jour.
nl: Vertragingen kunnen optreden door logistiek of piekdrukte. Ons supportteam helpt met tracking en updates.
zu: Ukubambezeleka kungase kwenzeke ngenxa yezokuthutha noma isidingo esiphezulu. Ithimba lethu lokusekela lizokusiza ngokulandelela nezibuyekezo.

source: Delivery
de: Lieferung
fr: Livraison
nl: Levering
zu: Ukulethwa

source: DELIVERY
de: LIEFERUNG
fr: LIVRAISON
nl: LEVERING
zu: UKULETHWA

source: Delivery availability may vary by location and courier schedules.
de: Die Lieferverfügbarkeit kann je nach Standort und Kurierdienst variieren.
fr: La disponibilité de la livraison peut varier selon la localisation et les horaires des transporteurs.
nl: De beschikbaarheid van levering kan variëren per locatie en koeriersschema.
zu: Ukutholakala kokulethwa kungahluka ngokuya ngendawo nezinhlelo zezithuthi.

source: Designed for the modern shopper. We blend simplicity with style to bring you everyday essentials you’ll love.
de: Entwickelt für den modernen Käufer. Wir verbinden Schlichtheit mit Stil, um Ihnen alltägliche Essentials zu bieten, die Sie lieben werden.
fr: Conçu pour le consommateur moderne. Nous allions simplicité et style pour vous offrir des essentiels du quotidien que vous allez adorer.
nl: Ontworpen voor de moderne shopper. We combineren eenvoud met stijl om je dagelijkse essentials te bieden waar je van zult houden.
zu: Yakhelwe umthengi wanamuhla. Sihlanganisa ubulula nesitayela ukuze sikulethele izinto zansuku zonke ozothanda.

source: Designed for the way <0/> you shop today
de: Entwickelt für die Art, wie Sie heute einkaufen
fr: Conçu pour la façon dont vous achetez aujourd’hui
nl: Ontworpen voor de manier waarop je vandaag winkelt
zu: Yakhelwe indlela othenga ngayo namuhla

source: Discover our most popular products, loved by customers for their quality, value, and style. Handpicked favorites you don't want to miss.
de: Entdecken Sie unsere beliebtesten Produkte, geschätzt von Kunden für ihre Qualität, ihren Wert und ihren Stil. Handverlesene Favoriten, die Sie nicht verpassen sollten.
fr: Découvrez nos produits les plus populaires, appréciés par nos clients pour leur qualité, leur valeur et leur style. Des favoris soigneusement sélectionnés à ne pas manquer.
nl: Ontdek onze populairste producten, geliefd vanwege hun kwaliteit, waarde en stijl. Zorgvuldig geselecteerde favorieten die je niet wilt missen.
zu: Thola imikhiqizo yethu edume kakhulu, ethandwa amakhasimende ngenxa yekhwalithi, inani nesitayela. Izintandokazi ezikhethwe ngokucophelela ongafuni ukuziphuthelwa.

source: Do I need to be present to sign for delivery?
de: Muss ich bei der Lieferung persönlich anwesend sein?
fr: Dois-je être présent pour signer lors de la livraison ?
nl: Moet ik aanwezig zijn om te tekenen voor de levering?
zu: Ngabe kudingeka ngibe khona ukuze ngisayine ngesikhathi sokulethwa?

source: Do you deliver on public holidays?
de: Liefern Sie an Feiertagen?
fr: Livrez-vous les jours fériés ?
nl: Leveren jullie op feestdagen?
zu: Niletha yini ngezinsuku zamaholide omphakathi?

source: Easy & Secure Checkout
de: Einfacher & sicherer Checkout
fr: Paiement simple et sécurisé
nl: Eenvoudig & veilig afrekenen
zu: Ukukhokha okulula nokuphephile

source: Enter your email
de: E-Mail-Adresse eingeben
fr: Entrez votre adresse e-mail
nl: Voer je e-mailadres in
zu: Faka ikheli lakho le-imeyili

source: Every delivery is covered by our Money Back Guarantee and supported by our customer care team.
de: Jede Lieferung ist durch unsere Geld-zurück-Garantie abgesichert und wird von unserem Kundenservice unterstützt.
fr: Chaque livraison est couverte par notre garantie de remboursement et soutenue par notre service client.
nl: Elke levering wordt gedekt door onze geld-terug-garantie en ondersteund door ons klantenserviceteam.
zu: Konke ukulethwa kugunyazwe isiqinisekiso sethu sokubuyiselwa kwemali futhi kusekelwa ithimba lethu lokunakekela amakhasimende.

source: Every detail is intentional — from the products we curate to the experience we deliver. We believe shopping should feel effortless, modern, and reliable.
de: Jedes Detail ist bewusst gewählt – von den Produkten, die wir kuratieren, bis hin zum Erlebnis, das wir bieten. Einkaufen sollte sich mühelos, modern und zuverlässig anfühlen.
fr: Chaque détail est intentionnel — des produits que nous sélectionnons à l’expérience que nous offrons. Nous pensons que le shopping doit être fluide, moderne et fiable.
nl: Elk detail is bewust gekozen — van de producten die we selecteren tot de ervaring die we bieden. Winkelen moet moeiteloos, modern en betrouwbaar aanvoelen.
zu: Yonke imininingwane icatshangwe kahle — kusukela emikhiqizweni esiyikhethayo kuya kulwazi esikunikeza lona. Sikholelwa ukuthi ukuthenga kufanele kube lula, kwesimanje futhi kuthembeke.

source: Explore →
de: Entdecken →
fr: Explorer →
nl: Ontdek →
zu: Hlola →

source: Fast, reliable shipping with transparent tracking from checkout to doorstep.
de: Schneller, zuverlässiger Versand mit transparenter Sendungsverfolgung vom Checkout bis zur Haustür.
fr: Livraison rapide et fiable avec un suivi transparent du paiement jusqu’à votre porte.
nl: Snelle en betrouwbare verzending met transparante tracking van afrekenen tot aan de deur.
zu: Ukuthunyelwa okusheshayo nokuthembekile okunokulandeleka okusobala kusukela ekukhokheni kuze kufike emnyango wakho.

source: FILTERS
de: FILTER
fr: FILTRES

source: Founded in 2023 by <0>Daniel Eghan</0> and <1>Dorcas Out</1>.
de: Gegründet im Jahr 2023 von <0>Daniel Eghan</0> und <1>Dorcas Out</1>.
fr: Fondée en 2023 par <0>Daniel Eghan</0> et <1>Dorcas Out</1>.
nl: Opgericht in 2023 door <0>Daniel Eghan</0> en <1>Dorcas Out</1>.
zu: Yasungulwa ngo-2023 ngu-<0>Daniel Eghan</0> no-<1>Dorcas Out</1>.

source: FREQUENTLY
de: HÄUFIG
fr: FOIRE AUX
nl: VEELGESTELDE
zu: IMIBUZO EVAME

source: Fully equipped product
de: Vollständig ausgestattetes Produkt
fr: Produit entièrement équipé
nl: Volledig uitgerust product
zu: Umkhiqizo ophelele

source: GET IN TOUCH
de: KONTAKT AUFNEHMEN
fr: CONTACTEZ-NOUS
nl: NEEM CONTACT OP
zu: XHUMANA NATHI

source: Head Office
de: Hauptsitz
fr: Siège social
nl: Hoofdkantoor
zu: Ihhovisi elikhulu

source: Headquartered in Johannesburg, South Africa, with a vision for offices around the world.
de: Hauptsitz in Johannesburg, Südafrika, mit einer Vision für Standorte weltweit.
fr: Basée à Johannesburg, en Afrique du Sud, avec une vision de bureaux dans le monde entier.
nl: Gevestigd in Johannesburg, Zuid-Afrika, met een visie op kantoren over de hele wereld.
zu: Izinhloko zenkampani ziseJohannesburg, eNingizimu Afrika, zinombono wamahhovisi emhlabeni wonke.

source: Home
de: Startseite
fr: Accueil
zu: Ikhaya

source: HOME
de: STARTSEITE
fr: ACCUEIL
zu: IKHAYA

source: HOW
de: WIE
fr: COMMENT
nl: HOE
zu: INDLELA

source: Interested in investing? Learn more on our Careers page.
de: Interessiert an einer Investition? Erfahren Sie mehr auf unserer Karriereseite.
fr: Intéressé par un investissement ? Découvrez-en plus sur notre page Carrières.
nl: Geïnteresseerd in investeren? Lees meer op onze carrièrepagina.
zu: Unentshisekelo yokutshala imali? Funda kabanzi ekhasini lethu leMisebenzi.

source: Invest & Sell
de: Investieren & Verkaufen
fr: Investir & Vendre
nl: Investeren & Verkopen
zu: Tshala imali & Thengisa

source: is a shopping app connecting millions of customers across 20+ countries with thousands of merchants in Africa and beyond. New products are added daily—from everyday essentials to new favorites you never knew existed.
de: ist eine Shopping-App, die Millionen von Kunden in über 20 Ländern mit tausenden Händlern in Afrika und darüber hinaus verbindet. Täglich kommen neue Produkte hinzu – von Alltagsartikeln bis hin zu neuen Favoriten.
fr: est une application de shopping reliant des millions de clients dans plus de 20 pays à des milliers de commerçants en Afrique et au-delà. De nouveaux produits sont ajoutés chaque jour — des essentiels du quotidien aux nouveaux favoris.
nl: is een shopping-app die miljoenen klanten in meer dan 20 landen verbindt met duizenden verkopers in Afrika en daarbuiten. Dagelijks worden nieuwe producten toegevoegd — van dagelijkse essentials tot nieuwe favorieten.
zu: iwuhlelo lokuthenga oluxhumanisa izigidi zamakhasimende emazweni angaphezu kwama-20 nabathengisi abaningi e-Afrika nangale kwayo. Imikhiqizo emisha yengezwa nsuku zonke — kusukela ezintweni zansuku zonke kuya ezintandokazini ezintsha.

source: Is next-day delivery available on all orders?
de: Ist eine Lieferung am nächsten Tag für alle Bestellungen verfügbar?
fr: La livraison le lendemain est-elle disponible pour toutes les commandes ?
nl: Is levering de volgende dag beschikbaar voor alle bestellingen?
zu: Ingabe ukulethwa kosuku olulandelayo kuyatholakala kuwo wonke ama-oda?

source: IT WORKS
de: ES FUNKTIONIERT
fr: ÇA MARCHE
nl: HET WERKT
zu: KUYASEBENZA

source: Join our newsletter for style tips, special offers, and early access to new products.
de: Abonnieren Sie unseren Newsletter für Styling-Tipps, exklusive Angebote und frühen Zugang zu neuen Produkten.
fr: Inscrivez-vous à notre newsletter pour des conseils de style, des offres exclusives et un accès anticipé aux nouveaux produits.
nl: Meld je aan voor onze nieuwsbrief voor stijltips, speciale aanbiedingen en vroege toegang tot nieuwe producten.

source: Kimberly Road, Judith Paarl, Johannesburg, South Africa
de: Kimberly Road, Judith Paarl, Johannesburg, Südafrika
fr: Kimberly Road, Judith Paarl, Johannesburg, Afrique du Sud
nl: Kimberly Road, Judith Paarl, Johannesburg, Zuid-Afrika
zu: Kimberly Road, Judith Paarl, Johannesburg, eNingizimu Afrika

source: Logout
de: Abmelden
fr: Se déconnecter
nl: Uitloggen
zu: Phuma

source: Menu
de: Menü
zu: Imenyu

source: Multiple payment options with a smooth checkout experience.
de: Mehrere Zahlungsmöglichkeiten mit einem reibungslosen Checkout-Erlebnis.
fr: Plusieurs options de paiement avec une expérience de paiement fluide.
nl: Meerdere betaalopties met een soepele checkout-ervaring.
zu: Izindlela zokukhokha eziningi ezinolwazi lokukhokha olushelelayo.

source: My order hasn’t arrived yet. Where is it?
de: Meine Bestellung ist noch nicht angekommen. Wo ist sie?
fr: Ma commande n’est pas encore arrivée. Où est-elle ?
nl: Mijn bestelling is nog niet aangekomen. Waar is deze?
zu: I-oda lami alikafiki. Likuphi?

source: My Profile
de: Mein Profil
fr: Mon profil
nl: Mijn profiel
zu: Iphrofayela yami

source: Next-Day Delivery
de: Lieferung am nächsten Tag
fr: Livraison le lendemain
nl: Levering de volgende dag
zu: Ukulethwa kosuku olulandelayo

source: Next-day delivery depends on product type and your delivery address.
de: Die Lieferung am nächsten Tag hängt vom Produkttyp und Ihrer Lieferadresse ab.
fr: La livraison le lendemain dépend du type de produit et de votre adresse de livraison.
nl: Levering de volgende dag is afhankelijk van het producttype en je afleveradres.
zu: Ukulethwa kosuku olulandelayo kuncike ohlotsheni lomkhiqizo nekheli lakho lokulethwa.

source: No products found
de: Keine Produkte gefunden
fr: Aucun produit trouvé
nl: Geen producten gevonden

source: OPTIONS
de: OPTIONEN
nl: OPTIES
zu: IZINKETHO

source: Order by 7pm on weekdays. All-day from $30.
de: Bestellung bis 19 Uhr an Werktagen. Ganztägig ab 30 $.
fr: Commandez avant 19h en semaine. Toute la journée à partir de 30 $.
nl: Bestel vóór 19.00 uur op werkdagen. Hele dag vanaf $30.
zu: Oda ngaphambi kuka-7 kusihlwa ngezinsuku zomsebenzi. Usuku lonke kusukela ku-$30.

source: Orders
de: Bestellungen
fr: Commandes
nl: Bestellingen
zu: Ama-oda

source: Our Mission
de: Unsere Mission
fr: Notre mission
nl: Onze missie
zu: Inhloso yethu

source: Our platform is designed to be inspiring, personalized, and reliable. The more you browse and buy, the smarter our recommendations become—tailored to your style, interests, and budget.
de: Unsere Plattform ist inspirierend, personalisiert und zuverlässig gestaltet. Je mehr Sie stöbern und einkaufen, desto intelligenter werden unsere Empfehlungen – abgestimmt auf Ihren Stil, Ihre Interessen und Ihr Budget.
fr: Notre plateforme est conçue pour être inspirante, personnalisée et fiable. Plus vous naviguez et achetez, plus nos recommandations deviennent intelligentes — adaptées à votre style, vos intérêts et votre budget.
nl: Ons platform is ontworpen om inspirerend, gepersonaliseerd en betrouwbaar te zijn. Hoe meer je bladert en koopt, hoe slimmer onze aanbevelingen worden — afgestemd op jouw stijl, interesses en budget.
zu: Ipulatifomu yethu yakhelwe ukuba ikhuthaze, ibe ngeyakho futhi ithembeke. Uma ubuka futhi uthenga kakhulu, iziphakamiso zethu ziba ngcono — zihambisane nesitayela sakho, izintshisekelo kanye nesabelomali.

source: Personalized Discovery
de: Personalisierte Entdeckung
fr: Découverte personnalisée
nl: Gepersonaliseerde ontdekking
zu: Ukutholakala okuqondene nawe

source: Phone: +27 784 281 036
de: Telefon: +27 784 281 036
fr: Téléphone : +27 784 281 036
nl: Telefoon: +27 784 281 036
zu: Ucingo: +27 784 281 036

source: Premium curation
de: Premium-Auswahl
fr: Sélection premium
nl: Premium selectie
zu: Ukukhethwa kwe-premium

source: Privacy policy
de: Datenschutzrichtlinie
fr: Politique de confidentialité
nl: Privacybeleid
zu: Inqubomgomo yobumfihlo

source: Proof of purchase
de: Kaufnachweis
fr: Preuve d’achat
nl: Aankoopbewijs
zu: Ubufakazi bokuthenga

source: Refunds are processed according to applicable legislation.
de: Rückerstattungen erfolgen gemäß den geltenden gesetzlichen Bestimmungen.
fr: Les remboursements sont traités conformément à la législation en vigueur.
nl: Terugbetalingen worden verwerkt volgens de geldende wetgeving.
zu: Ukubuyiselwa kwemali kwenziwa ngokuhambisana nemithetho esebenzayo.

source: Reliable Delivery
de: Zuverlässige Lieferung
fr: Livraison fiable
nl: Betrouwbare levering
zu: Ukulethwa okuthembekile

source: Responsive support, easy returns, and policies designed around real customers.
de: Reaktionsschneller Support, einfache Rückgaben und Richtlinien, die auf echte Kunden zugeschnitten sind.
fr: Un support réactif, des retours faciles et des politiques conçues pour de vrais clients.
nl: Snelle ondersteuning, eenvoudig retourneren en beleid gericht op echte klanten.

source: RETURNS
de: RÜCKGABEN
fr: RETOURS
nl: RETOUREN
zu: UKUBUYISA

source: Reviews ({0})
de: Bewertungen ({0})
fr: Avis ({0})
nl: Beoordelingen ({0})
zu: Izibuyekezo ({0})

source: Seamless delivery
de: Reibungslose Lieferung
fr: Livraison fluide
nl: Naadloze levering
zu: Ukulethwa okushelelayo

source: Select Size
de: Größe auswählen
fr: Sélectionner la taille
nl: Selecteer maat
zu: Khetha usayizi

source: SELLERS
de: VERKÄUFER
fr: VENTES
nl: VERKOPERS
zu: ABADAYISI

source: Selling is currently invite-only to ensure trust and quality across our marketplace.
de: Der Verkauf ist derzeit nur auf Einladung möglich, um Vertrauen und Qualität auf unserem Marktplatz zu gewährleisten.
fr: La vente est actuellement uniquement sur invitation afin de garantir la confiance et la qualité sur notre marketplace.
nl: Verkopen is momenteel alleen op uitnodiging om vertrouwen en kwaliteit binnen onze marktplaats te waarborgen.
zu: Ukudayisa okwamanje kwenziwa ngesimemo kuphela ukuze kuqinisekiswe ukwethembana nekhwalithi emakethe yethu.

source: Share your experience
de: Teilen Sie Ihre Erfahrung
fr: Partagez votre expérience
nl: Deel je ervaring
zu: Yabelana ngolwazi lwakho

source: Shop by Mood
de: Nach Stimmung shoppen
fr: Acheter selon l’humeur
nl: Shop op stemming
zu: Thenga ngokwesimo sengqondo

source: Sign up and shop—our platform learns your preferences and recommends products you’ll love.
de: Registrieren Sie sich und shoppen Sie – unsere Plattform lernt Ihre Vorlieben kennen und empfiehlt Produkte, die Sie lieben werden.
fr: Inscrivez-vous et faites vos achats — notre plateforme apprend vos préférences et vous recommande des produits que vous allez adorer.
nl: Meld je aan en shop — ons platform leert je voorkeuren kennen en beveelt producten aan waar je van zult houden.
zu: Bhalisa futhi uthenge — ipulatifomu yethu ifunda okuthandayo futhi iphakamise imikhiqizo ozoyithanda.

source: Some items may require a signature, especially high-value or large appliances.
de: Einige Artikel erfordern möglicherweise eine Unterschrift, insbesondere hochwertige oder große Geräte.
fr: Certains articles peuvent nécessiter une signature, notamment les produits de grande valeur ou les appareils volumineux.
nl: Sommige artikelen vereisen mogelijk een handtekening, vooral hoogwaardige of grote apparaten.
zu: Ezinye izinto zingadinga isignesha, ikakhulukazi izinto ezibizayo noma ezinkulu.

source: Sort by: High to Low
de: Sortieren nach: Hoch zu Niedrig
fr: Trier par : du plus élevé au plus bas
nl: Sorteren op: hoog naar laag

source: Sort by: Low to High
de: Sortieren nach: Niedrig zu Hoch
fr: Trier par : du plus bas au plus élevé
nl: Sorteren op: laag naar hoog

source: Sort by: Relavent
de: Sortieren nach: Relevanz
nl: Sorteren op: relevantie

source: Standard Delivery
de: Standardlieferung
fr: Livraison standard
nl: Standaardlevering
zu: Ukulethwa okujwayelekile

source: Submit Review
de: Bewertung absenden
fr: Envoyer un avis
nl: Beoordeling verzenden
zu: Thumela ukubuyekeza

source: SUBSCRIBE
de: ABONNIEREN
fr: S’ABONNER
nl: ABONNEREN
zu: BHALISA

source: Subscribe now & get 20% off
de: Jetzt abonnieren und 20 % Rabatt erhalten
fr: Abonnez-vous maintenant et obtenez 20 % de réduction
nl: Abonneer je nu en ontvang 20% korting
zu: Bhalisa manje uthole isaphulelo esingu-20%

source: Thoughtfully selected products that balance quality, design, and everyday practicality.
de: Sorgfältig ausgewählte Produkte, die Qualität, Design und Alltagstauglichkeit vereinen.
fr: Des produits soigneusement sélectionnés qui allient qualité, design et praticité au quotidien.
nl: Zorgvuldig geselecteerde producten die kwaliteit, design en dagelijks gebruiksgemak combineren.
zu: Imikhiqizo ekhethwe ngokucophelela ehlanganisa ikhwalithi, umklamo nokusebenza kwansuku zonke.

source: Time slots available. From $35.
de: Zeitfenster verfügbar. Ab 35 $.
fr: Créneaux horaires disponibles. À partir de 35 $.
nl: Tijdsloten beschikbaar. Vanaf $35.
zu: Izikhathi zokulethwa ziyatholakala. Kusukela ku-$35.

source: Time slots available. From $45.
de: Zeitfenster verfügbar. Ab 45 $.
fr: Créneaux horaires disponibles. À partir de 45 $.
nl: Tijdsloten beschikbaar. Vanaf $45.
zu: Izikhathi zokulethwa ziyatholakala. Kusukela ku-$45.

source: To empower customers with choice, convenience, and confidence—delivering a seamless shopping experience from discovery to delivery, backed by a strong money-back guarantee and responsive support.
de: Wir möchten Kunden Wahlfreiheit, Komfort und Vertrauen bieten – mit einem nahtlosen Einkaufserlebnis von der Entdeckung bis zur Lieferung, unterstützt durch eine starke Geld-zurück-Garantie und reaktionsschnellen Support.
fr: Donner aux clients le choix, la commodité et la confiance — en offrant une expérience d’achat fluide de la découverte à la livraison, soutenue par une solide garantie de remboursement et un support réactif.
nl: Klanten versterken met keuze, gemak en vertrouwen — door een naadloze winkelervaring te bieden van ontdekking tot levering, ondersteund door een sterke geld-terug-garantie en snelle ondersteuning.
zu: Ukuqinisa amakhasimende ngokubanika inketho, ukunethezeka nokuzethemba — ukuhlinzeka ngolwazi lokuthenga olungenazithiyo kusukela ekutholeni kuya ekulethweni, kusekelwa isiqinisekiso esiqinile sokubuyiselwa kwemali nokusekelwa okuphendulayo.

source: US
de: UNS
fr: NOUS
nl: ONS
zu: THINA
